espressif/esp-idf/components/soc/esp32c5/register/soc/lp_apm0_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LP_APM0_REGION_FILTER_EN_REG register
 *  Region enable register
 */
#define LP_APM0_REGION_FILTER_EN_REG (DR_REG_LP_APM0_BASE + 0x0)
/** LP_APM0_REGION_FILTER_EN : R/W; bitpos: [7:0]; default: 1;
 *  Configure bit $n (0-7) to enable region $n (0-7).
 *  0: Disable
 *  1: Enable
 */
#define LP_APM0_REGION_FILTER_EN    0x000000FFU
#define LP_APM0_REGION_FILTER_EN_M  (LP_APM0_REGION_FILTER_EN_V << LP_APM0_REGION_FILTER_EN_S)
#define LP_APM0_REGION_FILTER_EN_V  0x000000FFU
#define LP_APM0_REGION_FILTER_EN_S  0

/** LP_APM0_REGION0_ADDR_START_REG register
 *  Region address register
 */
#define LP_APM0_REGION0_ADDR_START_REG (DR_REG_LP_APM0_BASE + 0x4)
/** LP_APM0_REGION0_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of region 0.
 */
#define LP_APM0_REGION0_ADDR_START    0xFFFFFFFFU
#define LP_APM0_REGION0_ADDR_START_M  (LP_APM0_REGION0_ADDR_START_V << LP_APM0_REGION0_ADDR_START_S)
#define LP_APM0_REGION0_ADDR_START_V  0xFFFFFFFFU
#define LP_APM0_REGION0_ADDR_START_S  0

/** LP_APM0_REGION0_ADDR_END_REG register
 *  Region address register
 */
#define LP_APM0_REGION0_ADDR_END_REG (DR_REG_LP_APM0_BASE + 0x8)
/** LP_APM0_REGION0_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the end address of region 0.
 */
#define LP_APM0_REGION0_ADDR_END    0xFFFFFFFFU
#define LP_APM0_REGION0_ADDR_END_M  (LP_APM0_REGION0_ADDR_END_V << LP_APM0_REGION0_ADDR_END_S)
#define LP_APM0_REGION0_ADDR_END_V  0xFFFFFFFFU
#define LP_APM0_REGION0_ADDR_END_S  0

/** LP_APM0_REGION0_ATTR_REG register
 *  Region access permissions configuration register
 */
#define LP_APM0_REGION0_ATTR_REG (DR_REG_LP_APM0_BASE + 0xc)
/** LP_APM0_REGION0_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution permission in region 0 in REE0 mode.
 */
#define LP_APM0_REGION0_R0_X    (BIT(0))
#define LP_APM0_REGION0_R0_X_M  (LP_APM0_REGION0_R0_X_V << LP_APM0_REGION0_R0_X_S)
#define LP_APM0_REGION0_R0_X_V  0x00000001U
#define LP_APM0_REGION0_R0_X_S  0
/** LP_APM0_REGION0_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write permission in region 0 in REE0 mode.
 */
#define LP_APM0_REGION0_R0_W    (BIT(1))
#define LP_APM0_REGION0_R0_W_M  (LP_APM0_REGION0_R0_W_V << LP_APM0_REGION0_R0_W_S)
#define LP_APM0_REGION0_R0_W_V  0x00000001U
#define LP_APM0_REGION0_R0_W_S  1
/** LP_APM0_REGION0_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read permission in region 0 in REE0 mode.
 */
#define LP_APM0_REGION0_R0_R    (BIT(2))
#define LP_APM0_REGION0_R0_R_M  (LP_APM0_REGION0_R0_R_V << LP_APM0_REGION0_R0_R_S)
#define LP_APM0_REGION0_R0_R_V  0x00000001U
#define LP_APM0_REGION0_R0_R_S  2
/** LP_APM0_REGION0_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution permission in region 0 in REE1 mode.
 */
#define LP_APM0_REGION0_R1_X    (BIT(4))
#define LP_APM0_REGION0_R1_X_M  (LP_APM0_REGION0_R1_X_V << LP_APM0_REGION0_R1_X_S)
#define LP_APM0_REGION0_R1_X_V  0x00000001U
#define LP_APM0_REGION0_R1_X_S  4
/** LP_APM0_REGION0_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write permission in region 0 in REE1 mode.
 */
#define LP_APM0_REGION0_R1_W    (BIT(5))
#define LP_APM0_REGION0_R1_W_M  (LP_APM0_REGION0_R1_W_V << LP_APM0_REGION0_R1_W_S)
#define LP_APM0_REGION0_R1_W_V  0x00000001U
#define LP_APM0_REGION0_R1_W_S  5
/** LP_APM0_REGION0_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read permission in region 0 in REE1 mode.
 */
#define LP_APM0_REGION0_R1_R    (BIT(6))
#define LP_APM0_REGION0_R1_R_M  (LP_APM0_REGION0_R1_R_V << LP_APM0_REGION0_R1_R_S)
#define LP_APM0_REGION0_R1_R_V  0x00000001U
#define LP_APM0_REGION0_R1_R_S  6
/** LP_APM0_REGION0_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution permission in region 0 in REE2 mode.
 */
#define LP_APM0_REGION0_R2_X    (BIT(8))
#define LP_APM0_REGION0_R2_X_M  (LP_APM0_REGION0_R2_X_V << LP_APM0_REGION0_R2_X_S)
#define LP_APM0_REGION0_R2_X_V  0x00000001U
#define LP_APM0_REGION0_R2_X_S  8
/** LP_APM0_REGION0_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write permission in region 0 in REE2 mode.
 */
#define LP_APM0_REGION0_R2_W    (BIT(9))
#define LP_APM0_REGION0_R2_W_M  (LP_APM0_REGION0_R2_W_V << LP_APM0_REGION0_R2_W_S)
#define LP_APM0_REGION0_R2_W_V  0x00000001U
#define LP_APM0_REGION0_R2_W_S  9
/** LP_APM0_REGION0_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read permission in region 0 in REE2 mode.
 */
#define LP_APM0_REGION0_R2_R    (BIT(10))
#define LP_APM0_REGION0_R2_R_M  (LP_APM0_REGION0_R2_R_V << LP_APM0_REGION0_R2_R_S)
#define LP_APM0_REGION0_R2_R_V  0x00000001U
#define LP_APM0_REGION0_R2_R_S  10
/** LP_APM0_REGION0_LOCK : R/W; bitpos: [11]; default: 0;
 *  Configures to lock the value of region 0 configuration registers
 *  (LP_APM0_REGION0_ADDR_START_REG, LP_APM0_REGION0_ADDR_END_REG and
 *  LP_APM0_REGION0_ATTR_REG).
 *  0: Do not lock
 *  1: Lock
 */
#define LP_APM0_REGION0_LOCK    (BIT(11))
#define LP_APM0_REGION0_LOCK_M  (LP_APM0_REGION0_LOCK_V << LP_APM0_REGION0_LOCK_S)
#define LP_APM0_REGION0_LOCK_V  0x00000001U
#define LP_APM0_REGION0_LOCK_S  11

/** LP_APM0_REGION1_ADDR_START_REG register
 *  Region address register
 */
#define LP_APM0_REGION1_ADDR_START_REG (DR_REG_LP_APM0_BASE + 0x10)
/** LP_APM0_REGION1_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of region 1.
 */
#define LP_APM0_REGION1_ADDR_START    0xFFFFFFFFU
#define LP_APM0_REGION1_ADDR_START_M  (LP_APM0_REGION1_ADDR_START_V << LP_APM0_REGION1_ADDR_START_S)
#define LP_APM0_REGION1_ADDR_START_V  0xFFFFFFFFU
#define LP_APM0_REGION1_ADDR_START_S  0

/** LP_APM0_REGION1_ADDR_END_REG register
 *  Region address register
 */
#define LP_APM0_REGION1_ADDR_END_REG (DR_REG_LP_APM0_BASE + 0x14)
/** LP_APM0_REGION1_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the end address of region 1.
 */
#define LP_APM0_REGION1_ADDR_END    0xFFFFFFFFU
#define LP_APM0_REGION1_ADDR_END_M  (LP_APM0_REGION1_ADDR_END_V << LP_APM0_REGION1_ADDR_END_S)
#define LP_APM0_REGION1_ADDR_END_V  0xFFFFFFFFU
#define LP_APM0_REGION1_ADDR_END_S  0

/** LP_APM0_REGION1_ATTR_REG register
 *  Region access permissions configuration register
 */
#define LP_APM0_REGION1_ATTR_REG (DR_REG_LP_APM0_BASE + 0x18)
/** LP_APM0_REGION1_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution permission in region 1 in REE0 mode.
 */
#define LP_APM0_REGION1_R0_X    (BIT(0))
#define LP_APM0_REGION1_R0_X_M  (LP_APM0_REGION1_R0_X_V << LP_APM0_REGION1_R0_X_S)
#define LP_APM0_REGION1_R0_X_V  0x00000001U
#define LP_APM0_REGION1_R0_X_S  0
/** LP_APM0_REGION1_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write permission in region 1 in REE0 mode.
 */
#define LP_APM0_REGION1_R0_W    (BIT(1))
#define LP_APM0_REGION1_R0_W_M  (LP_APM0_REGION1_R0_W_V << LP_APM0_REGION1_R0_W_S)
#define LP_APM0_REGION1_R0_W_V  0x00000001U
#define LP_APM0_REGION1_R0_W_S  1
/** LP_APM0_REGION1_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read permission in region 1 in REE0 mode.
 */
#define LP_APM0_REGION1_R0_R    (BIT(2))
#define LP_APM0_REGION1_R0_R_M  (LP_APM0_REGION1_R0_R_V << LP_APM0_REGION1_R0_R_S)
#define LP_APM0_REGION1_R0_R_V  0x00000001U
#define LP_APM0_REGION1_R0_R_S  2
/** LP_APM0_REGION1_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution permission in region 1 in REE1 mode.
 */
#define LP_APM0_REGION1_R1_X    (BIT(4))
#define LP_APM0_REGION1_R1_X_M  (LP_APM0_REGION1_R1_X_V << LP_APM0_REGION1_R1_X_S)
#define LP_APM0_REGION1_R1_X_V  0x00000001U
#define LP_APM0_REGION1_R1_X_S  4
/** LP_APM0_REGION1_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write permission in region 1 in REE1 mode.
 */
#define LP_APM0_REGION1_R1_W    (BIT(5))
#define LP_APM0_REGION1_R1_W_M  (LP_APM0_REGION1_R1_W_V << LP_APM0_REGION1_R1_W_S)
#define LP_APM0_REGION1_R1_W_V  0x00000001U
#define LP_APM0_REGION1_R1_W_S  5
/** LP_APM0_REGION1_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read permission in region 1 in REE1 mode.
 */
#define LP_APM0_REGION1_R1_R    (BIT(6))
#define LP_APM0_REGION1_R1_R_M  (LP_APM0_REGION1_R1_R_V << LP_APM0_REGION1_R1_R_S)
#define LP_APM0_REGION1_R1_R_V  0x00000001U
#define LP_APM0_REGION1_R1_R_S  6
/** LP_APM0_REGION1_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution permission in region 1 in REE2 mode.
 */
#define LP_APM0_REGION1_R2_X    (BIT(8))
#define LP_APM0_REGION1_R2_X_M  (LP_APM0_REGION1_R2_X_V << LP_APM0_REGION1_R2_X_S)
#define LP_APM0_REGION1_R2_X_V  0x00000001U
#define LP_APM0_REGION1_R2_X_S  8
/** LP_APM0_REGION1_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write permission in region 1 in REE2 mode.
 */
#define LP_APM0_REGION1_R2_W    (BIT(9))
#define LP_APM0_REGION1_R2_W_M  (LP_APM0_REGION1_R2_W_V << LP_APM0_REGION1_R2_W_S)
#define LP_APM0_REGION1_R2_W_V  0x00000001U
#define LP_APM0_REGION1_R2_W_S  9
/** LP_APM0_REGION1_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read permission in region 1 in REE2 mode.
 */
#define LP_APM0_REGION1_R2_R    (BIT(10))
#define LP_APM0_REGION1_R2_R_M  (LP_APM0_REGION1_R2_R_V << LP_APM0_REGION1_R2_R_S)
#define LP_APM0_REGION1_R2_R_V  0x00000001U
#define LP_APM0_REGION1_R2_R_S  10
/** LP_APM0_REGION1_LOCK : R/W; bitpos: [11]; default: 0;
 *  Configures to lock the value of region 1 configuration registers
 *  (LP_APM0_REGION1_ADDR_START_REG, LP_APM0_REGION1_ADDR_END_REG and
 *  LP_APM0_REGION1_ATTR_REG).
 *  0: Do not lock
 *  1: Lock
 */
#define LP_APM0_REGION1_LOCK    (BIT(11))
#define LP_APM0_REGION1_LOCK_M  (LP_APM0_REGION1_LOCK_V << LP_APM0_REGION1_LOCK_S)
#define LP_APM0_REGION1_LOCK_V  0x00000001U
#define LP_APM0_REGION1_LOCK_S  11

/** LP_APM0_REGION2_ADDR_START_REG register
 *  Region address register
 */
#define LP_APM0_REGION2_ADDR_START_REG (DR_REG_LP_APM0_BASE + 0x1c)
/** LP_APM0_REGION2_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of region 2.
 */
#define LP_APM0_REGION2_ADDR_START    0xFFFFFFFFU
#define LP_APM0_REGION2_ADDR_START_M  (LP_APM0_REGION2_ADDR_START_V << LP_APM0_REGION2_ADDR_START_S)
#define LP_APM0_REGION2_ADDR_START_V  0xFFFFFFFFU
#define LP_APM0_REGION2_ADDR_START_S  0

/** LP_APM0_REGION2_ADDR_END_REG register
 *  Region address register
 */
#define LP_APM0_REGION2_ADDR_END_REG (DR_REG_LP_APM0_BASE + 0x20)
/** LP_APM0_REGION2_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the end address of region 2.
 */
#define LP_APM0_REGION2_ADDR_END    0xFFFFFFFFU
#define LP_APM0_REGION2_ADDR_END_M  (LP_APM0_REGION2_ADDR_END_V << LP_APM0_REGION2_ADDR_END_S)
#define LP_APM0_REGION2_ADDR_END_V  0xFFFFFFFFU
#define LP_APM0_REGION2_ADDR_END_S  0

/** LP_APM0_REGION2_ATTR_REG register
 *  Region access permissions configuration register
 */
#define LP_APM0_REGION2_ATTR_REG (DR_REG_LP_APM0_BASE + 0x24)
/** LP_APM0_REGION2_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution permission in region 2 in REE0 mode.
 */
#define LP_APM0_REGION2_R0_X    (BIT(0))
#define LP_APM0_REGION2_R0_X_M  (LP_APM0_REGION2_R0_X_V << LP_APM0_REGION2_R0_X_S)
#define LP_APM0_REGION2_R0_X_V  0x00000001U
#define LP_APM0_REGION2_R0_X_S  0
/** LP_APM0_REGION2_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write permission in region 2 in REE0 mode.
 */
#define LP_APM0_REGION2_R0_W    (BIT(1))
#define LP_APM0_REGION2_R0_W_M  (LP_APM0_REGION2_R0_W_V << LP_APM0_REGION2_R0_W_S)
#define LP_APM0_REGION2_R0_W_V  0x00000001U
#define LP_APM0_REGION2_R0_W_S  1
/** LP_APM0_REGION2_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read permission in region 2 in REE0 mode.
 */
#define LP_APM0_REGION2_R0_R    (BIT(2))
#define LP_APM0_REGION2_R0_R_M  (LP_APM0_REGION2_R0_R_V << LP_APM0_REGION2_R0_R_S)
#define LP_APM0_REGION2_R0_R_V  0x00000001U
#define LP_APM0_REGION2_R0_R_S  2
/** LP_APM0_REGION2_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution permission in region 2 in REE1 mode.
 */
#define LP_APM0_REGION2_R1_X    (BIT(4))
#define LP_APM0_REGION2_R1_X_M  (LP_APM0_REGION2_R1_X_V << LP_APM0_REGION2_R1_X_S)
#define LP_APM0_REGION2_R1_X_V  0x00000001U
#define LP_APM0_REGION2_R1_X_S  4
/** LP_APM0_REGION2_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write permission in region 2 in REE1 mode.
 */
#define LP_APM0_REGION2_R1_W    (BIT(5))
#define LP_APM0_REGION2_R1_W_M  (LP_APM0_REGION2_R1_W_V << LP_APM0_REGION2_R1_W_S)
#define LP_APM0_REGION2_R1_W_V  0x00000001U
#define LP_APM0_REGION2_R1_W_S  5
/** LP_APM0_REGION2_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read permission in region 2 in REE1 mode.
 */
#define LP_APM0_REGION2_R1_R    (BIT(6))
#define LP_APM0_REGION2_R1_R_M  (LP_APM0_REGION2_R1_R_V << LP_APM0_REGION2_R1_R_S)
#define LP_APM0_REGION2_R1_R_V  0x00000001U
#define LP_APM0_REGION2_R1_R_S  6
/** LP_APM0_REGION2_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution permission in region 2 in REE2 mode.
 */
#define LP_APM0_REGION2_R2_X    (BIT(8))
#define LP_APM0_REGION2_R2_X_M  (LP_APM0_REGION2_R2_X_V << LP_APM0_REGION2_R2_X_S)
#define LP_APM0_REGION2_R2_X_V  0x00000001U
#define LP_APM0_REGION2_R2_X_S  8
/** LP_APM0_REGION2_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write permission in region 2 in REE2 mode.
 */
#define LP_APM0_REGION2_R2_W    (BIT(9))
#define LP_APM0_REGION2_R2_W_M  (LP_APM0_REGION2_R2_W_V << LP_APM0_REGION2_R2_W_S)
#define LP_APM0_REGION2_R2_W_V  0x00000001U
#define LP_APM0_REGION2_R2_W_S  9
/** LP_APM0_REGION2_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read permission in region 2 in REE2 mode.
 */
#define LP_APM0_REGION2_R2_R    (BIT(10))
#define LP_APM0_REGION2_R2_R_M  (LP_APM0_REGION2_R2_R_V << LP_APM0_REGION2_R2_R_S)
#define LP_APM0_REGION2_R2_R_V  0x00000001U
#define LP_APM0_REGION2_R2_R_S  10
/** LP_APM0_REGION2_LOCK : R/W; bitpos: [11]; default: 0;
 *  Configures to lock the value of region 2 configuration registers
 *  (LP_APM0_REGION2_ADDR_START_REG, LP_APM0_REGION2_ADDR_END_REG and
 *  LP_APM0_REGION2_ATTR_REG).
 *  0: Do not lock
 *  1: Lock
 */
#define LP_APM0_REGION2_LOCK    (BIT(11))
#define LP_APM0_REGION2_LOCK_M  (LP_APM0_REGION2_LOCK_V << LP_APM0_REGION2_LOCK_S)
#define LP_APM0_REGION2_LOCK_V  0x00000001U
#define LP_APM0_REGION2_LOCK_S  11

/** LP_APM0_REGION3_ADDR_START_REG register
 *  Region address register
 */
#define LP_APM0_REGION3_ADDR_START_REG (DR_REG_LP_APM0_BASE + 0x28)
/** LP_APM0_REGION3_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of region 3.
 */
#define LP_APM0_REGION3_ADDR_START    0xFFFFFFFFU
#define LP_APM0_REGION3_ADDR_START_M  (LP_APM0_REGION3_ADDR_START_V << LP_APM0_REGION3_ADDR_START_S)
#define LP_APM0_REGION3_ADDR_START_V  0xFFFFFFFFU
#define LP_APM0_REGION3_ADDR_START_S  0

/** LP_APM0_REGION3_ADDR_END_REG register
 *  Region address register
 */
#define LP_APM0_REGION3_ADDR_END_REG (DR_REG_LP_APM0_BASE + 0x2c)
/** LP_APM0_REGION3_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the end address of region 3.
 */
#define LP_APM0_REGION3_ADDR_END    0xFFFFFFFFU
#define LP_APM0_REGION3_ADDR_END_M  (LP_APM0_REGION3_ADDR_END_V << LP_APM0_REGION3_ADDR_END_S)
#define LP_APM0_REGION3_ADDR_END_V  0xFFFFFFFFU
#define LP_APM0_REGION3_ADDR_END_S  0

/** LP_APM0_REGION3_ATTR_REG register
 *  Region access permissions configuration register
 */
#define LP_APM0_REGION3_ATTR_REG (DR_REG_LP_APM0_BASE + 0x30)
/** LP_APM0_REGION3_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution permission in region 3 in REE0 mode.
 */
#define LP_APM0_REGION3_R0_X    (BIT(0))
#define LP_APM0_REGION3_R0_X_M  (LP_APM0_REGION3_R0_X_V << LP_APM0_REGION3_R0_X_S)
#define LP_APM0_REGION3_R0_X_V  0x00000001U
#define LP_APM0_REGION3_R0_X_S  0
/** LP_APM0_REGION3_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write permission in region 3 in REE0 mode.
 */
#define LP_APM0_REGION3_R0_W    (BIT(1))
#define LP_APM0_REGION3_R0_W_M  (LP_APM0_REGION3_R0_W_V << LP_APM0_REGION3_R0_W_S)
#define LP_APM0_REGION3_R0_W_V  0x00000001U
#define LP_APM0_REGION3_R0_W_S  1
/** LP_APM0_REGION3_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read permission in region 3 in REE0 mode.
 */
#define LP_APM0_REGION3_R0_R    (BIT(2))
#define LP_APM0_REGION3_R0_R_M  (LP_APM0_REGION3_R0_R_V << LP_APM0_REGION3_R0_R_S)
#define LP_APM0_REGION3_R0_R_V  0x00000001U
#define LP_APM0_REGION3_R0_R_S  2
/** LP_APM0_REGION3_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution permission in region 3 in REE1 mode.
 */
#define LP_APM0_REGION3_R1_X    (BIT(4))
#define LP_APM0_REGION3_R1_X_M  (LP_APM0_REGION3_R1_X_V << LP_APM0_REGION3_R1_X_S)
#define LP_APM0_REGION3_R1_X_V  0x00000001U
#define LP_APM0_REGION3_R1_X_S  4
/** LP_APM0_REGION3_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write permission in region 3 in REE1 mode.
 */
#define LP_APM0_REGION3_R1_W    (BIT(5))
#define LP_APM0_REGION3_R1_W_M  (LP_APM0_REGION3_R1_W_V << LP_APM0_REGION3_R1_W_S)
#define LP_APM0_REGION3_R1_W_V  0x00000001U
#define LP_APM0_REGION3_R1_W_S  5
/** LP_APM0_REGION3_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read permission in region 3 in REE1 mode.
 */
#define LP_APM0_REGION3_R1_R    (BIT(6))
#define LP_APM0_REGION3_R1_R_M  (LP_APM0_REGION3_R1_R_V << LP_APM0_REGION3_R1_R_S)
#define LP_APM0_REGION3_R1_R_V  0x00000001U
#define LP_APM0_REGION3_R1_R_S  6
/** LP_APM0_REGION3_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution permission in region 3 in REE2 mode.
 */
#define LP_APM0_REGION3_R2_X    (BIT(8))
#define LP_APM0_REGION3_R2_X_M  (LP_APM0_REGION3_R2_X_V << LP_APM0_REGION3_R2_X_S)
#define LP_APM0_REGION3_R2_X_V  0x00000001U
#define LP_APM0_REGION3_R2_X_S  8
/** LP_APM0_REGION3_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write permission in region 3 in REE2 mode.
 */
#define LP_APM0_REGION3_R2_W    (BIT(9))
#define LP_APM0_REGION3_R2_W_M  (LP_APM0_REGION3_R2_W_V << LP_APM0_REGION3_R2_W_S)
#define LP_APM0_REGION3_R2_W_V  0x00000001U
#define LP_APM0_REGION3_R2_W_S  9
/** LP_APM0_REGION3_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read permission in region 3 in REE2 mode.
 */
#define LP_APM0_REGION3_R2_R    (BIT(10))
#define LP_APM0_REGION3_R2_R_M  (LP_APM0_REGION3_R2_R_V << LP_APM0_REGION3_R2_R_S)
#define LP_APM0_REGION3_R2_R_V  0x00000001U
#define LP_APM0_REGION3_R2_R_S  10
/** LP_APM0_REGION3_LOCK : R/W; bitpos: [11]; default: 0;
 *  Configures to lock the value of region 3 configuration registers
 *  (LP_APM0_REGION3_ADDR_START_REG, LP_APM0_REGION3_ADDR_END_REG and
 *  LP_APM0_REGION3_ATTR_REG).
 *  0: Do not lock
 *  1: Lock
 */
#define LP_APM0_REGION3_LOCK    (BIT(11))
#define LP_APM0_REGION3_LOCK_M  (LP_APM0_REGION3_LOCK_V << LP_APM0_REGION3_LOCK_S)
#define LP_APM0_REGION3_LOCK_V  0x00000001U
#define LP_APM0_REGION3_LOCK_S  11

/** LP_APM0_REGION4_ADDR_START_REG register
 *  Region address register
 */
#define LP_APM0_REGION4_ADDR_START_REG (DR_REG_LP_APM0_BASE + 0x34)
/** LP_APM0_REGION4_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of region 4.
 */
#define LP_APM0_REGION4_ADDR_START    0xFFFFFFFFU
#define LP_APM0_REGION4_ADDR_START_M  (LP_APM0_REGION4_ADDR_START_V << LP_APM0_REGION4_ADDR_START_S)
#define LP_APM0_REGION4_ADDR_START_V  0xFFFFFFFFU
#define LP_APM0_REGION4_ADDR_START_S  0

